[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:93:43
                             type="text"
                             isInvalid={Boolean(errors.tableOrBreakoutRoom)}
                             {...register("tableOrBreakoutRoom", {
-                                required: "Table or Breakout Room is required."
+                                required: ""
                             })}
                         />
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or Breakout Room is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:110:57
                             id="requestTime"
                             type="datetime-local"
                             isInvalid={Boolean(errors.requestTime)}
-                            {...register("requestTime", {
-                                required: true, pattern: isodate_regex
-                            })}
+                            {...register("requestTime", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request Time is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:111:43
                             type="datetime-local"
                             isInvalid={Boolean(errors.requestTime)}
                             {...register("requestTime", {
-                                required: true, pattern: isodate_regex
+                                required: false, pattern: isodate_regex
                             })}
                         />
killedBy: HelpRequest tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request Time is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:124:38
                 <Form.Group className="mb-3" >
                     <Form.Label htmlFor="explanation">Explanation</Form.Label>
                     <Form.Control
-                        data-testid={"HelpRequestForm-explanation"}
+                        data-testid={""}
                         id="explanation"
                         type="text"
killedBy: HelpRequest tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestForm-explanation"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] Regex
main/components/HelpRequest/HelpRequestForm.js:147:54
                         type="text"
                         isInvalid={Boolean(errors.solved)}
                         {...register("solved", {
-                            required: true, pattern: /^(true|false)$/
+                            required: true, pattern: /(true|false)$/
                         })}
                     />
killedBy: HelpRequest tests kill solved true mutant
statusReason: Error: Unable to find an element with the text: /Note: Solved must be true or false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/HelpRequest/HelpRequestForm.js:152:26
                     />
                     <Form.Control.Feedback type="invalid">
                         {errors.solved && 'Solved is required.'}
-                        {errors.solved?.type === 'pattern' && 'Note: Solved must be true or false'}
+                        {errors.solved.type === 'pattern' && 'Note: Solved must be true or false'}
                     </Form.Control.Feedback>
                 </Form.Group>
killedBy: HelpRequest tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
main/components/HelpRequest/HelpRequestForm.js:152:26
                     />
                     <Form.Control.Feedback type="invalid">
                         {errors.solved && 'Solved is required.'}
-                        {errors.solved?.type === 'pattern' && 'Note: Solved must be true or false'}
+                        {errors.solved?.type !== 'pattern' && 'Note: Solved must be true or false'}
                     </Form.Control.Feedback>
                 </Form.Group>
killedBy: HelpRequest tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Note: Solved must be true or false</div> instead
