[Killed] StringLiteral
src/main/utils/HelpRequestUtils.js:11:17
 export function cellToAxiosParamsDelete(cell) {
     return {
         url: "/api/helprequest",
-        method: "DELETE",
+        method: "",
         params: {
             id: cell.row.values.id
killedBy: HelpRequestUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
