[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:70:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.professorEmail && 'Professor Email is required. '}
-                            {errors.professorEmail?.type === 'pattern' && 'Professor Email must be email-format.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct error messages on bad input
statusReason: Error: Unable to find an element with the text: /Professor Email must be email-format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:70:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.professorEmail && 'Professor Email is required. '}
-                            {errors.professorEmail?.type === 'pattern' && 'Professor Email must be email-format.'}
+                            {true && 'Professor Email must be email-format.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests No Errors on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Professor Email must be email-format.</div> instead

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:82:42
                             id="explanation"
                             type="text"
                             isInvalid={Boolean(errors.explanation)}
-                            {...register("explanation", {required:true})}
+                            {...register("", {required:true})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:112:42
                             id="dateNeeded"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateNeeded)}
-                            {...register("dateNeeded", {required: true, pattern: date_regex})}
+                            {...register("", {required: true, pattern: date_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:127:66
                             id="completed"
                             type="boolean"
                             isInvalid={Boolean(errors.completed)}
-                            {...register("completed", {required: true})}
+                            {...register("completed", {required: false})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests error messages on missing input
statusReason: Error: Unable to find an element with the text: /Completed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:127:42
                             id="completed"
                             type="boolean"
                             isInvalid={Boolean(errors.completed)}
-                            {...register("completed", {required: true})}
+                            {...register("", {required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:130:30
                             {...register("completed", {required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.completed && 'Completed is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests error messages on missing input
statusReason: Error: Unable to find an element with the text: /Completed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:130:30
                             {...register("completed", {required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.completed && 'Completed is required. '}
+                            {errors.completed || 'Completed is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct error messages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
