[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:45:9
             Header: 'Explanation',
             accessor: 'explanation'
         },
-        {
-            Header: 'Date Requested',
-            accessor: 'dateRequested'
-        },
+        {},
         {
             Header: 'Date Needed',
killedBy: UserTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:47:23
         },
         {
             Header: 'Date Requested',
-            accessor: 'dateRequested'
+            accessor: ""
         },
         {
killedBy: UserTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-dateRequested"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:49:9
             Header: 'Date Requested',
             accessor: 'dateRequested'
         },
-        {
-            Header: 'Date Needed',
-            accessor: 'dateNeeded'
-        },
+        {},
         {
             Header: 'Done',
killedBy: UserTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:53:9
             Header: 'Date Needed',
             accessor: 'dateNeeded'
         },
-        {
-            Header: 'Done',
-            accessor: 'done'
-        }
+        {}
     ];
 
killedBy: UserTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:54:21
             accessor: 'dateNeeded'
         },
         {
-            Header: 'Done',
+            Header: "",
             accessor: 'done'
         }
killedBy: UserTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Done. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:59:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"))
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"))
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
     return <OurTable
killedBy: UserTable tests Correct headers and content for admin
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:60:35
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"))
+        columns.push(ButtonColumn("", "primary", editCallback, "RecommendationRequestTable"))
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"))
     }
killedBy: UserTable tests Correct headers and content for admin
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:60:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"))
+        columns.push(ButtonColumn("Edit", "", editCallback, "RecommendationRequestTable"))
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"))
     }
killedBy: UserTable tests Correct headers and content for admin
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:61:35
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"))
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"))
+        columns.push(ButtonColumn("", "danger", deleteCallback, "RecommendationRequestTable"))
     }
 
killedBy: UserTable tests Correct headers and content for admin
statusReason: Error: A column ID (or string accessor) is required!
