[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:57:30
                             />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester Email is required. '}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester Email must be email-format.'}
+                            {errors.requesterEmail?.type !== 'pattern' && 'Requester Email must be email-format.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Requester Email/

Here are the matching elements:

<label
  class="form-label"
  for="requesterEmail"
>

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:57:30
                             />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester Email is required. '}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester Email must be email-format.'}
+                            {errors.requesterEmail.type === 'pattern' && 'Requester Email must be email-format.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:73:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.professorEmail && 'Professor Email is required. '}
-                            {errors.professorEmail?.type === 'pattern' && 'Professor Email must be email-format.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct error messages on bad input
statusReason: Error: Unable to find an element with the text: /Professor Email must be email-format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:73:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.professorEmail && 'Professor Email is required. '}
-                            {errors.professorEmail?.type === 'pattern' && 'Professor Email must be email-format.'}
+                            {errors.professorEmail.type === 'pattern' && 'Professor Email must be email-format.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:85:67
                             id="explanation"
                             type="text"
                             isInvalid={Boolean(errors.explanation)}
-                            {...register("explanation", {required:true})}
+                            {...register("explanation", {required:false})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:88:30
                             {...register("explanation", {required:true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.explanation && 'Explanation is required. '}
+                            {errors.explanation || 'Explanation is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct error messages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:88:30
                             {...register("explanation", {required:true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.explanation && 'Explanation is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:100:70
                             id="dateRequested"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateRequested)}
-                            {...register("dateRequested", {required: true, pattern: date_regex})}
+                            {...register("dateRequested", {required: false, pattern: date_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct error messages on bad input
statusReason: Error: Unable to find an element with the text: /Date Requested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:115:67
                             id="dateNeeded"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateNeeded)}
-                            {...register("dateNeeded", {required: true, pattern: date_regex})}
+                            {...register("dateNeeded", {required: false, pattern: date_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct error messages on bad input
statusReason: Error: Unable to find an element with the text: /Date Needed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:130:61
                             id="done"
                             type="text"
                             isInvalid={Boolean(errors.done)}
-                            {...register("done", {required: true, pattern: truefalse_regex})}
+                            {...register("done", {required: false, pattern: truefalse_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests error messages on missing input
statusReason: Error: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:133:30
                             {...register("done", {required: true, pattern: truefalse_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.done && 'Done is required. '}
+                            {false}
                             {errors.done?.type === 'pattern' && 'Done must be true or false.'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests error messages on missing input
statusReason: Error: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:134:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.done && 'Done is required. '}
-                            {errors.done?.type === 'pattern' && 'Done must be true or false.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct error messages on bad input
statusReason: Error: Unable to find an element with the text: /Done must be true or false./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:134:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.done && 'Done is required. '}
-                            {errors.done?.type === 'pattern' && 'Done must be true or false.'}
+                            {errors.done?.type !== 'pattern' && 'Done must be true or false.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct error messages on bad input
statusReason: Error: Unable to find an element with the text: /Done must be true or false./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
